felixJR123/zmk-esp32-dongle/src/esp32_status_uart.c
#include <errno.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <zephyr/device.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/sys/util.h>
#include <hal/nrf_power.h>

#include <zmk/activity.h>
#include <zmk/ble.h>
#include <zmk/behavior.h>
#include <zmk/endpoints.h>
#include <zmk/event_manager.h>
#include <zmk/events/battery_state_changed.h>
#include <zmk/events/ble_active_profile_changed.h>
#include <zmk/events/activity_state_changed.h>
#include <zmk/events/endpoint_changed.h>
#include <zmk/events/keycode_state_changed.h>
#include <zmk/events/layer_state_changed.h>
#include <zmk/events/modifiers_state_changed.h>
#include <zmk/events/position_state_changed.h>
#include <zmk/events/usb_conn_state_changed.h>
#include <zmk/hid.h>
#include <zmk/keymap.h>
#if IS_ENABLED(CONFIG_ZMK_HID_INDICATORS)
#include <zmk/events/hid_indicators_changed.h>
#include <zmk/hid_indicators.h>
#endif
#if IS_ENABLED(CONFIG_ZMK_WPM)
#include <zmk/events/wpm_state_changed.h>
#endif
#include <zmk/usb.h>
#if IS_ENABLED(CONFIG_ZMK_ESP32_PROFILE_NAMING)
#include <zephyr/bluetooth/bluetooth.h>
#endif

#define STATUS_UART_NODE DT_NODELABEL(uart0)
#define HID_LED_CAPS_LOCK BIT(1)
#define BT_PROFILE_NAMES_NODE DT_PATH(bt_profile_names)
#define BT_PROFILE_NAME_NODE(n) DT_PATH(bt_profile_names, profile_##n)
#define BT_PROFILE_NAME_LABEL(n, fallback)                                                         \
    COND_CODE_1(DT_NODE_EXISTS(BT_PROFILE_NAME_NODE(n)),                                           \
                (DT_PROP_OR(BT_PROFILE_NAME_NODE(n), label, fallback)), (fallback))

#define ESP32_DECK_TILE_1_NODE DT_PATH(esp32_deck, tile_1)
#define ESP32_DECK_TILE_2_NODE DT_PATH(esp32_deck, tile_2)
#define ESP32_DECK_TILE_3_NODE DT_PATH(esp32_deck, tile_3)
#define ESP32_DECK_TILE_4_NODE DT_PATH(esp32_deck, tile_4)
#define ESP32_DECK_TILE_5_NODE DT_PATH(esp32_deck, tile_5)
#define ESP32_DECK_TILE_6_NODE DT_PATH(esp32_deck, tile_6)
#define ESP32_DECK_TILE_7_NODE DT_PATH(esp32_deck, tile_7)
#define ESP32_DECK_TILE_8_NODE DT_PATH(esp32_deck, tile_8)
#define ESP32_DECK_TILE_9_NODE DT_PATH(esp32_deck, tile_9)
#define ESP32_DECK_TILE_LABEL(node, fallback)                                                      \
    COND_CODE_1(DT_NODE_EXISTS(node), (DT_PROP_OR(node, label, fallback)), (fallback))
#define ESP32_DECK_EMPTY_BINDING                                                                   \
    { .behavior_dev = NULL, .param1 = 0, .param2 = 0 }

#define ESP32_VOL_NODE    DT_PATH(esp32_volume)
#define ESP32_VOL_UP_NODE DT_PATH(esp32_volume, vol_up)
#define ESP32_VOL_DN_NODE DT_PATH(esp32_volume, vol_dn)
#define ESP32_VOL_MUTE_NODE DT_PATH(esp32_volume, mute)
#define ESP32_VOL_BINDING(node)                                                                    \
    COND_CODE_1(DT_NODE_EXISTS(node),                                                              \
                (ZMK_KEYMAP_EXTRACT_BINDING(0, node)),                                             \
                (ESP32_DECK_EMPTY_BINDING))
#define ESP32_DECK_TILE_BINDING(node)                                                              \
    COND_CODE_1(DT_NODE_EXISTS(node),                                                              \
                (COND_CODE_1(DT_NODE_HAS_PROP(node, bindings),                                     \
                             (ZMK_KEYMAP_EXTRACT_BINDING(0, node)),                                \
                             (ESP32_DECK_EMPTY_BINDING))),                                         \
                (ESP32_DECK_EMPTY_BINDING))

/* Sub-tile DT helpers: esp32_deck_menu_tiles / menu_tile_M / subtile_S */
#define ESP32_SUBTILE_NODE(m, s) \
    DT_PATH(esp32_deck_menu_tiles, menu_tile_##m, subtile_##s)
#define ESP32_SUBTILE_BINDING(m, s)                                                                \
    COND_CODE_1(DT_NODE_EXISTS(ESP32_SUBTILE_NODE(m, s)),                                          \
                (COND_CODE_1(DT_NODE_HAS_PROP(ESP32_SUBTILE_NODE(m, s), bindings),                 \
                             (ZMK_KEYMAP_EXTRACT_BINDING(0, ESP32_SUBTILE_NODE(m, s))),            \
                             (ESP32_DECK_EMPTY_BINDING))),                                         \
                (ESP32_DECK_EMPTY_BINDING))
#define ESP32_SUBTILE_LABEL(m, s, fb)                                                              \
    COND_CODE_1(DT_NODE_EXISTS(ESP32_SUBTILE_NODE(m, s)),                                          \
                (DT_PROP_OR(ESP32_SUBTILE_NODE(m, s), label, fb)), (fb))
#define ESP32_SUBTILE_BINDINGS_ROW(m) {                                                            \
    ESP32_SUBTILE_BINDING(m, 1), ESP32_SUBTILE_BINDING(m, 2), ESP32_SUBTILE_BINDING(m, 3),        \
    ESP32_SUBTILE_BINDING(m, 4), ESP32_SUBTILE_BINDING(m, 5), ESP32_SUBTILE_BINDING(m, 6),        \
    ESP32_SUBTILE_BINDING(m, 7), ESP32_SUBTILE_BINDING(m, 8), ESP32_SUBTILE_BINDING(m, 9),        \
}
#define ESP32_SUBTILE_LABELS_ROW(m) {                                                              \
    ESP32_SUBTILE_LABEL(m, 1, ""), ESP32_SUBTILE_LABEL(m, 2, ""), ESP32_SUBTILE_LABEL(m, 3, ""),  \
    ESP32_SUBTILE_LABEL(m, 4, ""), ESP32_SUBTILE_LABEL(m, 5, ""), ESP32_SUBTILE_LABEL(m, 6, ""),  \
    ESP32_SUBTILE_LABEL(m, 7, ""), ESP32_SUBTILE_LABEL(m, 8, ""), ESP32_SUBTILE_LABEL(m, 9, ""),  \
}

static const struct device *const status_uart = DEVICE_DT_GET(STATUS_UART_NODE);

static int current_wpm;
static uint8_t peripheral_batteries[CONFIG_ZMK_ESP32_STATUS_UART_MAX_PERIPHERALS];
static bool peripheral_battery_seen[CONFIG_ZMK_ESP32_STATUS_UART_MAX_PERIPHERALS];
static char command_line[96];
static char pending_command_line[96];
static size_t command_line_len;
static volatile bool pending_command_ready;
static const char *const deck_tile_labels[] = {
    ESP32_DECK_TILE_LABEL(ESP32_DECK_TILE_1_NODE, CONFIG_ZMK_ESP32_DECK_TILE_1_LABEL),
    ESP32_DECK_TILE_LABEL(ESP32_DECK_TILE_2_NODE, CONFIG_ZMK_ESP32_DECK_TILE_2_LABEL),
    ESP32_DECK_TILE_LABEL(ESP32_DECK_TILE_3_NODE, CONFIG_ZMK_ESP32_DECK_TILE_3_LABEL),
    ESP32_DECK_TILE_LABEL(ESP32_DECK_TILE_4_NODE, CONFIG_ZMK_ESP32_DECK_TILE_4_LABEL),
    ESP32_DECK_TILE_LABEL(ESP32_DECK_TILE_5_NODE, CONFIG_ZMK_ESP32_DECK_TILE_5_LABEL),
    ESP32_DECK_TILE_LABEL(ESP32_DECK_TILE_6_NODE, CONFIG_ZMK_ESP32_DECK_TILE_6_LABEL),
    ESP32_DECK_TILE_LABEL(ESP32_DECK_TILE_7_NODE, CONFIG_ZMK_ESP32_DECK_TILE_7_LABEL),
    ESP32_DECK_TILE_LABEL(ESP32_DECK_TILE_8_NODE, CONFIG_ZMK_ESP32_DECK_TILE_8_LABEL),
    ESP32_DECK_TILE_LABEL(ESP32_DECK_TILE_9_NODE, CONFIG_ZMK_ESP32_DECK_TILE_9_LABEL),
};
/* Up to 8 host BT profile labels (peripherals are not counted).
 * Set labels via the bt_profile_names DTS node in your keyboard overlay,
 * or via CONFIG_ZMK_ESP32_BT_PROFILE_N_LABEL in your .conf file.
 * Empty labels are skipped; the screen falls back to "BTN" automatically. */
static const char *const bt_profile_names[] = {
    BT_PROFILE_NAME_LABEL(1, CONFIG_ZMK_ESP32_BT_PROFILE_1_LABEL),
    BT_PROFILE_NAME_LABEL(2, CONFIG_ZMK_ESP32_BT_PROFILE_2_LABEL),
    BT_PROFILE_NAME_LABEL(3, CONFIG_ZMK_ESP32_BT_PROFILE_3_LABEL),
    BT_PROFILE_NAME_LABEL(4, CONFIG_ZMK_ESP32_BT_PROFILE_4_LABEL),
    BT_PROFILE_NAME_LABEL(5, CONFIG_ZMK_ESP32_BT_PROFILE_5_LABEL),
    BT_PROFILE_NAME_LABEL(6, CONFIG_ZMK_ESP32_BT_PROFILE_6_LABEL),
    BT_PROFILE_NAME_LABEL(7, CONFIG_ZMK_ESP32_BT_PROFILE_7_LABEL),
    BT_PROFILE_NAME_LABEL(8, CONFIG_ZMK_ESP32_BT_PROFILE_8_LABEL),
};

static const struct zmk_behavior_binding deck_tile_bindings[] = {
    ESP32_DECK_TILE_BINDING(ESP32_DECK_TILE_1_NODE),
    ESP32_DECK_TILE_BINDING(ESP32_DECK_TILE_2_NODE),
    ESP32_DECK_TILE_BINDING(ESP32_DECK_TILE_3_NODE),
    ESP32_DECK_TILE_BINDING(ESP32_DECK_TILE_4_NODE),
    ESP32_DECK_TILE_BINDING(ESP32_DECK_TILE_5_NODE),
    ESP32_DECK_TILE_BINDING(ESP32_DECK_TILE_6_NODE),
    ESP32_DECK_TILE_BINDING(ESP32_DECK_TILE_7_NODE),
    ESP32_DECK_TILE_BINDING(ESP32_DECK_TILE_8_NODE),
    ESP32_DECK_TILE_BINDING(ESP32_DECK_TILE_9_NODE),
};

static const struct zmk_behavior_binding sub_tile_bindings[9][9] = {
    ESP32_SUBTILE_BINDINGS_ROW(1),
    ESP32_SUBTILE_BINDINGS_ROW(2),
    ESP32_SUBTILE_BINDINGS_ROW(3),
    ESP32_SUBTILE_BINDINGS_ROW(4),
    ESP32_SUBTILE_BINDINGS_ROW(5),
    ESP32_SUBTILE_BINDINGS_ROW(6),
    ESP32_SUBTILE_BINDINGS_ROW(7),
    ESP32_SUBTILE_BINDINGS_ROW(8),
    ESP32_SUBTILE_BINDINGS_ROW(9),
};

