felixJR123/zmk-esp32-dongle/src/esp32_status_uart.c
static const struct zmk_behavior_binding vol_bindings[3] = {
    ESP32_VOL_BINDING(ESP32_VOL_UP_NODE),
    ESP32_VOL_BINDING(ESP32_VOL_DN_NODE),
    ESP32_VOL_BINDING(ESP32_VOL_MUTE_NODE),
};

static const char *const sub_tile_labels[9][9] = {
    ESP32_SUBTILE_LABELS_ROW(1),
    ESP32_SUBTILE_LABELS_ROW(2),
    ESP32_SUBTILE_LABELS_ROW(3),
    ESP32_SUBTILE_LABELS_ROW(4),
    ESP32_SUBTILE_LABELS_ROW(5),
    ESP32_SUBTILE_LABELS_ROW(6),
    ESP32_SUBTILE_LABELS_ROW(7),
    ESP32_SUBTILE_LABELS_ROW(8),
    ESP32_SUBTILE_LABELS_ROW(9),
};

extern int set_state(enum zmk_activity_state state);

static void send_status_work_handler(struct k_work *work);
static void periodic_status_work_handler(struct k_work *work);
static void receive_command_work_handler(struct k_work *work);
static void bt_names_retry_work_handler(struct k_work *work);
static void deck_labels_retry_work_handler(struct k_work *work);
static void sub_tile_labels_retry_work_handler(struct k_work *work);

K_WORK_DELAYABLE_DEFINE(send_status_work, send_status_work_handler);
K_WORK_DELAYABLE_DEFINE(periodic_status_work, periodic_status_work_handler);
K_WORK_DELAYABLE_DEFINE(receive_command_work, receive_command_work_handler);
K_WORK_DELAYABLE_DEFINE(bt_names_retry_work, bt_names_retry_work_handler);
K_WORK_DELAYABLE_DEFINE(deck_labels_retry_work, deck_labels_retry_work_handler);
K_WORK_DELAYABLE_DEFINE(sub_tile_labels_retry_work, sub_tile_labels_retry_work_handler);

static bool bt_names_ack_pending = false;
static bool deck_labels_ack_pending = false;
static bool sub_tile_labels_ack_pending = false;

static void uart_write_string(const char *text) {
    for (const char *p = text; *p != '\0'; p++) {
        uart_poll_out(status_uart, *p);
    }
}

static int peripheral_count(void) {
    int count = 0;

    for (int i = 0; i < CONFIG_ZMK_ESP32_STATUS_UART_MAX_PERIPHERALS; i++) {
        if (peripheral_battery_seen[i]) {
            count = i + 1;
        }
    }

    return count;
}

static void append_battery_list(char *line, size_t line_len, int count) {
    size_t used = strlen(line);

    for (int i = 0; i < count && used < line_len; i++) {
        int written = snprintf(line + used, line_len - used, "%s%u", i == 0 ? "" : ",",
                               peripheral_battery_seen[i] ? peripheral_batteries[i] : 0);
        if (written < 0) {
            return;
        }
        used += MIN((size_t)written, line_len - used);
    }
}

static void sanitize_value(const char *input, char *output, size_t output_len) {
    if (output_len == 0) {
        return;
    }

    size_t out = 0;
    for (const char *p = input; *p != '\0' && out < output_len - 1; p++) {
        char c = *p;
        output[out++] = (c == ' ' || c == ';' || c == '=') ? '_' : c;
    }
    output[out] = '\0';
}

static void send_status_line(void) {
    if (!device_is_ready(status_uart)) {
        return;
    }

    zmk_keymap_layer_index_t layer_index = zmk_keymap_highest_layer_active();
    zmk_keymap_layer_id_t layer_id = zmk_keymap_layer_index_to_id(layer_index);
    const char *layer_name = zmk_keymap_layer_name(layer_id);
    if (layer_name == NULL || layer_name[0] == '\0') {
        layer_name = "Default";
    }
    char layer_value[32];
    sanitize_value(layer_name, layer_value, sizeof(layer_value));

    struct zmk_endpoint_instance selected_endpoint = zmk_endpoint_get_selected();
    int bt_slot = zmk_ble_active_profile_index() + 1;
    bool usb_ready = zmk_usb_is_hid_ready();
    bool bt_connected = false;
    if (selected_endpoint.transport == ZMK_TRANSPORT_BLE) {
        bt_slot = selected_endpoint.ble.profile_index + 1;
        bt_connected = zmk_ble_profile_is_connected(selected_endpoint.ble.profile_index);
    }
    const char *conn = selected_endpoint.transport == ZMK_TRANSPORT_USB
                           ? "usb"
                           : selected_endpoint.transport == ZMK_TRANSPORT_BLE ? "bt" : "none";
    int count = peripheral_count();
    enum zmk_activity_state activity = zmk_activity_get_state();
    const char *display = activity == ZMK_ACTIVITY_ACTIVE ? "on" : "off";
    zmk_mod_flags_t modifiers = zmk_hid_get_keyboard_report()->body.modifiers;
#if IS_ENABLED(CONFIG_ZMK_HID_INDICATORS)
    int capslock = (zmk_hid_indicators_get_current_profile() & HID_LED_CAPS_LOCK) ? 1 : 0;
#else
    int capslock = 0;
#endif

    char line[220];
    snprintf(line, sizeof(line),
             "layer=%s usb=%d bt=%d bt_slot=%d conn=%s ctrl=%d alt=%d win=%d shift=%d "
             "capslock=%d wpm=%d display=%s bt_open=%d usb_avail=%d bt_profiles=%d peripherals=%d batt=",
             layer_value, usb_ready ? 1 : 0, bt_connected ? 1 : 0, bt_slot, conn,
             (modifiers & (MOD_LCTL | MOD_RCTL)) ? 1 : 0,
             (modifiers & (MOD_LALT | MOD_RALT)) ? 1 : 0,
             (modifiers & (MOD_LGUI | MOD_RGUI)) ? 1 : 0,
             (modifiers & (MOD_LSFT | MOD_RSFT)) ? 1 : 0,
             capslock, current_wpm, display,
             zmk_ble_active_profile_is_open() ? 1 : 0,
             usb_ready ? 1 : 0,
             ZMK_BLE_PROFILE_COUNT, count);

    append_battery_list(line, sizeof(line), count);
    strncat(line, "\n", sizeof(line) - strlen(line) - 1);

    uart_write_string(line);
}

static void send_deck_label_line(int tile, const char *label) {
    if (label == NULL || label[0] == '\0') {
        return;
    }

    char safe_label[48];
    sanitize_value(label, safe_label, sizeof(safe_label));

    char line[80];
    snprintf(line, sizeof(line), "deck_tile=%d label=%s\n", tile, safe_label);
    uart_write_string(line);
}

static void send_deck_label_lines(void) {
    if (!device_is_ready(status_uart)) {
        return;
    }

    for (int i = 0; i < ARRAY_SIZE(deck_tile_labels); i++) {
        send_deck_label_line(i + 1, deck_tile_labels[i]);
    }
}

static void send_sub_tile_label_line(int parent, int sub, const char *label)
{
    if (label == NULL || label[0] == '\0') {
        return;
    }

    char safe_label[48];
    sanitize_value(label, safe_label, sizeof(safe_label));

    char line[80];
    snprintf(line, sizeof(line), "sub_tile_label=%d_%d label=%s\n", parent, sub, safe_label);
    uart_write_string(line);
}

