felixJR123/zmk-esp32-dongle/src/esp32_status_uart.c
static void send_sub_tile_label_lines(void)
{
    if (!device_is_ready(status_uart)) {
        return;
    }

    for (int m = 0; m < 9; m++) {
        for (int s = 0; s < 9; s++) {
            send_sub_tile_label_line(m + 1, s + 1, sub_tile_labels[m][s]);
        }
    }
}

static void send_deck_labels_with_done(void) {
    if (!device_is_ready(status_uart)) {
        return;
    }
    send_deck_label_lines();
    uart_write_string("deck_labels_done\n");
    deck_labels_ack_pending = true;
    k_work_reschedule(&deck_labels_retry_work, K_MSEC(1000));
}

static void deck_labels_retry_work_handler(struct k_work *work) {
    if (deck_labels_ack_pending) {
        send_deck_labels_with_done();
    }
}

static void send_sub_tile_labels_with_done(void) {
    if (!device_is_ready(status_uart)) {
        return;
    }
    send_sub_tile_label_lines();
    uart_write_string("sub_tile_labels_done\n");
    sub_tile_labels_ack_pending = true;
    k_work_reschedule(&sub_tile_labels_retry_work, K_MSEC(1000));
}

static void sub_tile_labels_retry_work_handler(struct k_work *work) {
    if (sub_tile_labels_ack_pending) {
        send_sub_tile_labels_with_done();
    }
}

static void send_bt_profile_name_line(int profile, const char *name) {
    if (name == NULL || name[0] == '\0') {
        return;
    }
    char safe_name[48];
    sanitize_value(name, safe_name, sizeof(safe_name));
    char line[72];
    snprintf(line, sizeof(line), "bt_name=%d label=%s\n", profile, safe_name);
    uart_write_string(line);
}

static void send_bt_profile_name_lines(void) {
    if (!device_is_ready(status_uart)) {
        return;
    }
    int count = MIN((int)ARRAY_SIZE(bt_profile_names), ZMK_BLE_PROFILE_COUNT);
    for (int i = 0; i < count; i++) {
        send_bt_profile_name_line(i + 1, bt_profile_names[i]);
    }
}

static void send_bt_names_with_done(void) {
    if (!device_is_ready(status_uart)) {
        return;
    }
    send_bt_profile_name_lines();
    uart_write_string("bt_names_done\n");
    bt_names_ack_pending = true;
    k_work_reschedule(&bt_names_retry_work, K_MSEC(1000));
}

static void bt_names_retry_work_handler(struct k_work *work) {
    if (bt_names_ack_pending) {
        send_bt_names_with_done();
    }
}

static void send_deck_result_line(int tile, int sub, int result) {
    char line[64];
    if (sub > 0) {
        snprintf(line, sizeof(line), "deck_result=%d_%d status=%s code=%d\n",
                 tile, sub, result == 0 ? "ok" : "error", result);
    } else {
        snprintf(line, sizeof(line), "deck_result=%d status=%s code=%d\n",
                 tile, result == 0 ? "ok" : "error", result);
    }
    uart_write_string(line);
}

static void send_command_ack_line(const char *command)
{
    const char *name = "unknown";

    if (strstr(command, "cmd=usb") != NULL) {
        name = "usb";
    } else if (strstr(command, "cmd=bt") != NULL) {
        name = "bt";
    } else if (strstr(command, "cmd=deck") != NULL) {
        name = "deck";
    } else if (strstr(command, "cmd=sync") != NULL) {
        name = "sync";
    } else if (strstr(command, "cmd=clear_profile") != NULL) {
        name = "clear_profile";
    } else if (strstr(command, "cmd=clear_all_profiles") != NULL) {
        name = "clear_all_profiles";
    } else if (strstr(command, "cmd=wake") != NULL) {
        name = "wake";
    } else if (strstr(command, "cmd=boot") != NULL) {
        name = "boot";
    } else if (strstr(command, "cmd=vol") != NULL) {
        name = "vol";
    } else if (strstr(command, "cmd=req_names") != NULL) {
        name = "req_names";
    } else if (strstr(command, "cmd=req_deck_labels") != NULL) {
        name = "req_deck_labels";
    } else if (strstr(command, "cmd=req_sub_labels") != NULL) {
        name = "req_sub_labels";
    }

    char line[40];
    snprintf(line, sizeof(line), "cmd_ack=%s\n", name);
    uart_write_string(line);
}

static void schedule_status_send(void) {
    k_work_reschedule(&send_status_work, K_MSEC(CONFIG_ZMK_ESP32_STATUS_UART_EVENT_DELAY_MS));
}

static void send_status_now(void) {
    k_work_reschedule(&send_status_work, K_NO_WAIT);
}

static void send_status_work_handler(struct k_work *work) { send_status_line(); }

static void periodic_status_work_handler(struct k_work *work) {
    send_status_line();
    k_work_reschedule(&periodic_status_work, K_MSEC(CONFIG_ZMK_ESP32_STATUS_UART_PERIODIC_MS));
}

static int command_profile_index(const char *line) {
    const char *profile = strstr(line, "profile=");
    if (profile == NULL) {
        return zmk_ble_active_profile_index();
    }

    int one_based = atoi(profile + strlen("profile="));
    if (one_based <= 0) {
        return 0;
    }
    return one_based - 1;
}

static int command_tile_number(const char *line) {
    const char *tile = strstr(line, "tile=");
    if (tile == NULL) {
        return 0;
    }

    return atoi(tile + strlen("tile="));
}

static void parse_tile_spec(const char *line, int *parent, int *sub)
{
    *parent = 0;
    *sub = 0;
    const char *tile = strstr(line, "tile=");
    if (tile == NULL) {
        return;
    }
    tile += strlen("tile=");
    *parent = atoi(tile);
    const char *underscore = strchr(tile, '_');
    if (underscore != NULL) {
        *sub = atoi(underscore + 1);
    }
}

static void queue_received_command(void)
{
    if (command_line_len == 0) {
        return;
    }

    command_line[command_line_len] = '\0';
    strncpy(pending_command_line, command_line, sizeof(pending_command_line) - 1);
    pending_command_line[sizeof(pending_command_line) - 1] = '\0';
    pending_command_ready = true;
    command_line_len = 0;
    k_work_reschedule(&receive_command_work, K_NO_WAIT);
}

static void append_received_command_byte(uint8_t c)
{
    if (c == '\r') {
        return;
    }

    if (c == '\n') {
        queue_received_command();
        return;
    }

    if (command_line_len < sizeof(command_line) - 1) {
        command_line[command_line_len++] = (char)c;
    } else {
        command_line_len = 0;
    }
}

static int invoke_deck_tile(int tile) {
    if (tile < 1 || tile > ARRAY_SIZE(deck_tile_bindings)) {
        return -EINVAL;
    }

    const struct zmk_behavior_binding *binding = &deck_tile_bindings[tile - 1];
    if (binding->behavior_dev == NULL) {
        return -ENOENT;
    }

    zmk_keymap_layer_index_t layer_index = zmk_keymap_highest_layer_active();
    zmk_keymap_layer_id_t layer_id = zmk_keymap_layer_index_to_id(layer_index);
    struct zmk_behavior_binding_event event = {
        .layer = layer_id,
        .position = 0xE000 + tile,
        .timestamp = k_uptime_get(),
#if IS_ENABLED(CONFIG_ZMK_SPLIT)
        .source = ZMK_POSITION_STATE_CHANGE_SOURCE_LOCAL,
#endif
    };

