felixJR123/zmk-esp32-dongle/src/esp32_status_uart.c
    int ret = zmk_behavior_invoke_binding(binding, event, true);
    if (ret < 0) {
        return ret;
    }

    k_msleep(10);
    event.timestamp = k_uptime_get();
    return zmk_behavior_invoke_binding(binding, event, false);
}

static int invoke_sub_tile(int parent, int sub)
{
    if (parent < 1 || parent > 9 || sub < 1 || sub > 9) {
        return -EINVAL;
    }

    const struct zmk_behavior_binding *binding = &sub_tile_bindings[parent - 1][sub - 1];
    if (binding->behavior_dev == NULL) {
        return -ENOENT;
    }

    zmk_keymap_layer_index_t layer_index = zmk_keymap_highest_layer_active();
    zmk_keymap_layer_id_t layer_id = zmk_keymap_layer_index_to_id(layer_index);
    struct zmk_behavior_binding_event event = {
        .layer = layer_id,
        .position = 0xE100 + (parent - 1) * 9 + (sub - 1),
        .timestamp = k_uptime_get(),
#if IS_ENABLED(CONFIG_ZMK_SPLIT)
        .source = ZMK_POSITION_STATE_CHANGE_SOURCE_LOCAL,
#endif
    };

    int ret = zmk_behavior_invoke_binding(binding, event, true);
    if (ret < 0) {
        return ret;
    }

    k_msleep(10);
    event.timestamp = k_uptime_get();
    return zmk_behavior_invoke_binding(binding, event, false);
}

static int invoke_volume_binding(int index) {
    if (index < 0 || index >= 3) {
        return -EINVAL;
    }
    const struct zmk_behavior_binding *binding = &vol_bindings[index];
    if (binding->behavior_dev == NULL) {
        return -ENOENT;
    }
    zmk_keymap_layer_index_t layer_index = zmk_keymap_highest_layer_active();
    zmk_keymap_layer_id_t layer_id = zmk_keymap_layer_index_to_id(layer_index);
    struct zmk_behavior_binding_event event = {
        .layer = layer_id,
        .position = 0xE200,
        .timestamp = k_uptime_get(),
#if IS_ENABLED(CONFIG_ZMK_SPLIT)
        .source = ZMK_POSITION_STATE_CHANGE_SOURCE_LOCAL,
#endif
    };
    int ret = zmk_behavior_invoke_binding(binding, event, true);
    if (ret < 0) {
        return ret;
    }
    k_msleep(10);
    event.timestamp = k_uptime_get();
    return zmk_behavior_invoke_binding(binding, event, false);
}

static void handle_command_line(const char *line) {
    if (strstr(line, "ack=bt_names") != NULL) {
        bt_names_ack_pending = false;
        k_work_cancel_delayable(&bt_names_retry_work);
        return;
    }

    if (strstr(line, "ack=deck_labels") != NULL) {
        deck_labels_ack_pending = false;
        k_work_cancel_delayable(&deck_labels_retry_work);
        return;
    }

    if (strstr(line, "ack=sub_tile_labels") != NULL) {
        sub_tile_labels_ack_pending = false;
        k_work_cancel_delayable(&sub_tile_labels_retry_work);
        return;
    }

    send_command_ack_line(line);

    if (strstr(line, "cmd=usb") != NULL) {
        zmk_endpoint_set_preferred_transport(ZMK_TRANSPORT_USB);
        send_status_now();
        return;
    }

    if (strstr(line, "cmd=bt") != NULL) {
        int profile = command_profile_index(line);
        if (profile >= 0 && profile < ZMK_BLE_PROFILE_COUNT) {
            zmk_ble_prof_select(profile);
        }
        zmk_endpoint_set_preferred_transport(ZMK_TRANSPORT_BLE);
        send_status_now();
        k_msleep(80);
        send_status_now();
        return;
    }

    if (strstr(line, "cmd=clear_profile") != NULL) {
        zmk_ble_clear_bonds();
        send_status_now();
        return;
    }

    if (strstr(line, "cmd=clear_all_profiles") != NULL) {
        zmk_ble_clear_all_bonds();
        send_status_now();
        return;
    }

    if (strstr(line, "cmd=deck") != NULL) {
        int parent = 0, sub = 0;
        parse_tile_spec(line, &parent, &sub);
        if (sub > 0) {
            int ret = invoke_sub_tile(parent, sub);
            send_deck_result_line(parent, sub, ret);
        } else {
            int ret = invoke_deck_tile(parent);
            send_deck_result_line(parent, 0, ret);
        }
        send_status_now();
        return;
    }

    if (strstr(line, "cmd=wake") != NULL) {
        set_state(ZMK_ACTIVITY_ACTIVE);
        send_status_now();
        return;
    }

    if (strstr(line, "cmd=sync") != NULL) {
        send_status_now();
        send_deck_labels_with_done();
        send_sub_tile_labels_with_done();
        send_bt_names_with_done();
        return;
    }

    if (strstr(line, "cmd=req_names") != NULL) {
        send_bt_names_with_done();
        return;
    }

    if (strstr(line, "cmd=req_deck_labels") != NULL) {
        send_deck_labels_with_done();
        return;
    }

    if (strstr(line, "cmd=req_sub_labels") != NULL) {
        send_sub_tile_labels_with_done();
        return;
    }

    if (strstr(line, "cmd=boot") != NULL) {
        nrf_power_gpregret_set(NRF_POWER, 0, 0x57);
        sys_reboot(SYS_REBOOT_COLD);
        return;
    }

    if (strstr(line, "cmd=vol") != NULL) {
        if (strstr(line, "up") != NULL) {
            invoke_volume_binding(0);
        } else if (strstr(line, "down") != NULL) {
            invoke_volume_binding(1);
        } else if (strstr(line, "mute") != NULL) {
            invoke_volume_binding(2);
        }
        return;
    }
}

static void receive_command_work_handler(struct k_work *work) {
#if IS_ENABLED(CONFIG_UART_INTERRUPT_DRIVEN)
    if (pending_command_ready) {
        char line[sizeof(pending_command_line)];
        strncpy(line, pending_command_line, sizeof(line) - 1);
        line[sizeof(line) - 1] = '\0';
        pending_command_ready = false;
        handle_command_line(line);
    }
#else
    unsigned char c;
    while (uart_poll_in(status_uart, &c) == 0) {
        append_received_command_byte(c);
        if (pending_command_ready) {
            char line[sizeof(pending_command_line)];
            strncpy(line, pending_command_line, sizeof(line) - 1);
            line[sizeof(line) - 1] = '\0';
            pending_command_ready = false;
            handle_command_line(line);
        }
    }

    k_work_reschedule(&receive_command_work, K_MSEC(30));
#endif
}

#if IS_ENABLED(CONFIG_UART_INTERRUPT_DRIVEN)
static void status_uart_callback(const struct device *dev, void *user_data)
{
    while (uart_irq_update(dev) && uart_irq_is_pending(dev)) {
        if (!uart_irq_rx_ready(dev)) {
            continue;
        }

        uint8_t buffer[16];
        int read;
        do {
            read = uart_fifo_read(dev, buffer, sizeof(buffer));
            for (int i = 0; i < read; ++i) {
                append_received_command_byte(buffer[i]);
            }
        } while (read == sizeof(buffer));
    }
}
#endif

static int esp32_status_listener(const zmk_event_t *eh) {
    if (as_zmk_keycode_state_changed(eh) != NULL ||
        as_zmk_modifiers_state_changed(eh) != NULL) {
        schedule_status_send();
        return 0;
    }

#if IS_ENABLED(CONFIG_ZMK_HID_INDICATORS)
    if (as_zmk_hid_indicators_changed(eh) != NULL) {
        send_status_now();
        return 0;
    }
#endif

