felixJR123/zmk-esp32-dongle/src/esp32_status_uart.c
    const struct zmk_activity_state_changed *activity_ev = as_zmk_activity_state_changed(eh);
    if (activity_ev != NULL) {
        send_status_now();
        if (activity_ev->state == ZMK_ACTIVITY_ACTIVE) {
            k_work_reschedule(&periodic_status_work,
                              K_MSEC(CONFIG_ZMK_ESP32_STATUS_UART_PERIODIC_MS));
        }
        return 0;
    }

    if (as_zmk_endpoint_changed(eh) != NULL) {
        send_status_now();
        return 0;
    }

#if IS_ENABLED(CONFIG_ZMK_ESP32_PROFILE_NAMING)
    const struct zmk_ble_active_profile_changed *profile_ev =
        as_zmk_ble_active_profile_changed(eh);
    if (profile_ev != NULL) {
        char name[CONFIG_BT_DEVICE_NAME_MAX + 1];
        snprintf(name, sizeof(name), "%s-BT%d",
                 CONFIG_BT_DEVICE_NAME, profile_ev->index + 1);
        bt_set_name(name);
    }
#endif

#if IS_ENABLED(CONFIG_ZMK_WPM)
    const struct zmk_wpm_state_changed *wpm_event = as_zmk_wpm_state_changed(eh);
    if (wpm_event != NULL) {
        current_wpm = wpm_event->state;
    }
#endif

    const struct zmk_peripheral_battery_state_changed *battery_event =
        as_zmk_peripheral_battery_state_changed(eh);
    if (battery_event != NULL &&
        battery_event->source < CONFIG_ZMK_ESP32_STATUS_UART_MAX_PERIPHERALS) {
        peripheral_batteries[battery_event->source] = battery_event->state_of_charge;
        peripheral_battery_seen[battery_event->source] = true;
    }

    schedule_status_send();
    return 0;
}

static int esp32_status_init(void) {
    if (!device_is_ready(status_uart)) {
        return -ENODEV;
    }

#if IS_ENABLED(CONFIG_UART_INTERRUPT_DRIVEN)
    int ret = uart_irq_callback_user_data_set(status_uart, status_uart_callback, NULL);
    if (ret < 0) {
        return ret;
    }
    uart_irq_rx_enable(status_uart);
#else
    k_work_reschedule(&receive_command_work, K_MSEC(30));
#endif

#if IS_ENABLED(CONFIG_ZMK_ESP32_PROFILE_NAMING)
    {
        char name[CONFIG_BT_DEVICE_NAME_MAX + 1];
        snprintf(name, sizeof(name), "%s-BT%d",
                 CONFIG_BT_DEVICE_NAME,
                 zmk_ble_active_profile_index() + 1);
        bt_set_name(name);
    }
#endif
    schedule_status_send();
    send_deck_labels_with_done();
    send_sub_tile_labels_with_done();
    send_bt_names_with_done();
    k_work_reschedule(&periodic_status_work, K_MSEC(CONFIG_ZMK_ESP32_STATUS_UART_PERIODIC_MS));
    return 0;
}

SYS_INIT(esp32_status_init, APPLICATION, CONFIG_APPLICATION_INIT_PRIORITY);

ZMK_LISTENER(esp32_status_uart, esp32_status_listener);
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_layer_state_changed);
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_keycode_state_changed);
#if IS_ENABLED(CONFIG_ZMK_HID_INDICATORS)
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_hid_indicators_changed);
#endif
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_modifiers_state_changed);
#if IS_ENABLED(CONFIG_ZMK_WPM)
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_wpm_state_changed);
#endif
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_ble_active_profile_changed);
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_usb_conn_state_changed);
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_peripheral_battery_state_changed);
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_activity_state_changed);
ZMK_SUBSCRIPTION(esp32_status_uart, zmk_endpoint_changed);
